keywords=["突袭","圣盾","吸血","剧毒","嘲讽","风怒","潜行","复生"]
keywords_dangerous=["冲锋","免疫","回响"]
minion_class=["德鲁伊","猎人","法师","骑士","牧师","潜行者","萨满","术士","战士","中立"]
minion_rarety=["普通","稀有","史诗","传说"]
effect_alone=["","无法成为法术或英雄技能的目标。","所有濒死随从都会强制死亡。","冻结任何受到该随从伤害的角色。","同时对其攻击目标相邻的随从造成伤害。","无法攻击。"]
effect_change=["减少","增加","为"]
minion_race=["随从","机械","野兽","鱼人","龙","恶魔","海盗","图腾","元素"]
target_all=["所有","你","对手"]
card_type=["随从","法术","武器","英雄"]

single_operation_minion=["召唤","发现","为你的对手召唤","为双方各召唤"]
single_operation_spell=["释放","发现","为你的对手释放","为双方各释放"]
single_operation_weapon=["装备","发现","为你的对手装备","为双方各装备"]
double_operation=[{"prep":"将","verb":"置入"},{"prep":"将","verb":"洗入"}]


multitrigger_target=["战吼","亡语","法术迸发","激励","超杀","回合结束","回合开始","扳机"]
multitrigger_effect=["触发两次","触发三次","触发次数翻倍"]


target_hand=["双方手牌中","你的手牌中","对手手牌中"]
target_deck=["双方牌库里","你的牌库里","对手牌库里"]

restriction_type_minion=["法力消耗"]
restriction_type_spell=["法力消耗"]
restriction_type_weapon=["法力消耗","攻击力","耐久度"]
restriction_type_hero=["法力消耗","护甲值"]
restriction_type_heropower=["的法力消耗","造成的伤害","恢复的生命值","造成的伤害和恢复的生命值"]
restriction_time=["本局对战中","本回合内","上回合中"]
restriction_battlefield=["双方场上的","你的场上的","对手场上的"]
restriction_used=["使用过的","你使用过的","你的对手使用过的"]
restriction_dead=["死亡的","死亡的友方","死亡的敌方"]
restriction_destroyed=["被摧毁的","你的被摧毁的","对手被摧毁的"]
restriction_discarded=["被弃掉的","你弃掉的","你的对手弃掉的"]
restriction_direction=["为","不大于","不小于"]

number_choice=["该随从攻击力","该随从的法力消耗","该随从生命值","你的英雄的攻击力","你的武器的攻击力","你打出的上一张法术的法力消耗","本回合你使用过的牌的数量","场上其它友方随从数量","你的手牌数量","对手手牌数量","你的英雄已损失生命值"]

restriction_independent_minion=["青玉魔像","麻疯侏儒","跟班","小鸡","银背族长","无证药剂师","愤怒卫士","咆哮魔","地精炸弹","魔能机甲","奇利亚斯","绵羊","青蛙"]
restriction_independent_spell=["香蕉","奥术飞弹","炎爆术","幸运币","炸弹","伏击牌","零件","地雷","卡扎库斯的药水","维伦的恩泽","心灵震爆","群体狂乱","绝命乱斗","尤格萨隆的谜之匣","宝藏","终极感染"]
restriction_independent_weapon=["弑君","炽焰战斧","毁灭之锤"]

trigger_time_0=["战吼:","亡语:","法术迸发:","每个回合结束时,","你的回合结束时,","每个回合开始时,","战吼,亡语:","你的回合开始时,","激励:","超杀:","休眠两回合,苏醒时,","激励,超杀:","流放:","连击:","流放,连击:","对手回合结束时,","对手回合开始时,","亡语,激励,超杀:","战吼,亡语,激励,超杀:","战吼,亡语,激励,超杀,流放,连击:"]/*,"法术迸发:"]*/
trigger_time_1=[{"prefix":"每当","suffix":","},{"prefix":"在","suffix":"之后,"}]

play_from=["一个玩家","你","你的对手"]
trigger_from=["有随从","该随从","有角色","你的英雄"]
trigger_action=["受到伤害","造成伤害","攻击并造成伤害","攻击并消灭一个随从"]

battlecry_condition=["在本回合结束时,","在你的下个回合开始时,","在你的对手下个回合开始时,","如果你没有其它手牌,","如果你的牌库里没有相同的牌,","如果你的手牌里有龙牌,","如果你控制任何野兽,","如果你控制任何鱼人,","如果你控制任何机械,","如果你控制任何奥秘,","如果你装备一把武器,","如果你在上回合打出过元素牌,","如果你的克苏恩有至少10点攻击力,","如果你已经祈求过两次,","如果你拥有10颗法力水晶","如果你的牌库中只有法力值消耗为奇数的牌,","如果你的牌库中只有法力值消耗为偶数的牌,"]
general_condition=["如果你的手牌里有龙牌,","如果你控制任何野兽,","如果你控制任何鱼人,","如果你控制任何机械,","如果你控制任何奥秘,","如果你装备一把武器,","如果你在上回合使用过元素牌,","如果你的牌库里没有牌,","如果你的牌库、手牌和场上没有牌,"]

buff_type_0=[{"verb":"消灭"}]
buff_type_1=[{"prep":"对","verb":"造成","noun":"伤害"},{"prep":"为","verb":"恢复","noun":"生命值"},{"prep":"使","verb":"在本回合内获得","noun":"攻击力"},{"prep":"使","verb":"获得","noun":"生命值"}]
buff_type_2=[{"prep":"使","verb":"获得"}]
single_operation=[{"verb":"抽","qua":"张","noun":"牌","up_bound":1,"low_bound":1},{"verb":"获得","qua":"点","noun":"护甲","up_bound":3,"low_bound":2},{"verb":"本回合内获得","qua":"个","noun":"法力水晶","up_bound":10,"low_bound":1},{"verb":"造成","qua":"点","noun":"伤害随机分配到所有敌人身上","up_bound":2,"low_bound":2},{"verb":"为你的英雄恢复","qua":"点","noun":"生命值","up_bound":3,"low_bound":2}]

buff_target_no_race=["一个敌方随从","一个随机敌方随从","两个随机敌方随从","三个随机敌方随从","所有敌方随从","随机英雄","你的英雄","敌方英雄","双方英雄"]
buff_target_with_race=["一个","一个随机","两个随机","三个随机","一个友方","一个随机友方","两个随机友方","三个随机友方","所有友方","一个敌方","一个随机敌方","两个随机敌方","三个随机敌方","所有敌方","相邻的"]

independent=["祈求迦拉克隆","交换双方手牌","交换双方牌库","将一个随机随从洗入你的牌库顶部,对一个随机角色释放神圣愤怒","将对手的手牌替换为你的手牌的复制","将你的手牌替换为对手的手牌的复制","你使用的下一张机械牌具有磁力且可以和任意随从合体","升级你的英雄技能","你的英雄技能法力消耗减少(1)点","对一个随机随从造成1-20点伤害","获得一个额外回合","你的对手跳过下一回合","将所有随从变形为魔能机甲","使所有随从消失","使你的护甲值翻倍"]

